DataProcessors/ЗагрузкаКартСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКартСчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаОткрытиеСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОткрытиеСчетов</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделениеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтделенияБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводНачальныхСведений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБанка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмбоссированныйТекст1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмбоссированныйТекст2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмбоссированныйТекст3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорБанка</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗагрузкаКартСчетов/Ext/ObjectModule.bsl
Процедура ВыборФайлаДляЗагрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "(*.xls)|*.xls";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = "xls";
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


Процедура ВыполнитьЗагрузку() Экспорт
	
	Окно = Новый COMОбъект("Excel.Application");
	Книги = Окно.Workbooks;
	Книга = Книги.open(СокрЛП(Файлзагрузки)); 
	
	Если Книга.ActiveSheet.Name <> "Sheet1" Тогда
		Книга.WorkSheets("Sheet1").Activate();    	
	КонецЕсли;
	
	ТЗ=Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("ФИО");
	ТЗ.Колонки.Добавить("Картсчет");
	ТЗ.Колонки.Добавить("ДатаРождения");
	
	Для ном = 2 по 1000 Цикл		
		
		ФИО = Окно.Cells(ном,1).Value;
		
		Если СокрЛП(ФИО)="" Тогда
			Прервать;
		КонецЕсли;
		
		КартСчет = Окно.Cells(ном,2).Value;
		ДатаРождения = Окно.Cells(ном,3).Value;
		
		НоваяСтрока=ТЗ.Добавить();
		
		НоваяСтрока.ФИО=СокрЛП(ФИО);
		НоваяСтрока.КартСчет=СокрЛП(КартСчет);
		НоваяСтрока.ДатаРождения=СтрЗаменить(СокрЛП(ДатаРождения),"/",".");
		
	КонецЦикла;
	
	Попытка
		Окно.Application.Quit();
	Исключение		
	КонецПопытки;
		
	СтруктураОтбора=Новый Структура;
	СтруктураОтбора.Вставить("Организация",Организация);
	
	ВыборкаЗаявок=Документы.ЗаявкаНаОткрытиеСчетов.Выбрать(ВыбДата, ВыбДата,СтруктураОтбора);
	
	Если ВыборкаЗаявок.Следующий()  ТОгда
		Заявка=ВыборкаЗаявок.ПолучитьОбъект();			
		Заявка.РаботникиОрганизации.Очистить();;
	Иначе
		Заявка=Документы.ЗаявкаНаОткрытиеСчетов.СоздатьДокумент();
	КонецЕсли;
	
	Заявка.Организация=Организация;
	Заявка.Дата=ВыбДата;
	Заявка.ВводНачальныхСведений=Истина;
	
	ЗапросФизЛиц=Новый Запрос;
	
	ЗапросФизЛиц.Текст=
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка,
	|	ФизическиеЛица.Наименование КАК ФИО,
	|	ФизическиеЛица.ДатаРождения
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица";
	
	ВыборкаФизЛиц=ЗапросФизЛиц.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ВыборкаФизЛиц Цикл
		Стр.ФИО=ВРЕГ(СТР.ФИО);
		Стр.ФИО=СтрЗаменить(Стр.ФИО,"  "," ");
	КонецЦикла;
	
	ОтборФизЛиц=Новый Структура;
	
	Попытка
		
		НачатьТранзакцию();
		
		Для каждого Стр Из ТЗ Цикл
						
			Нашли=Ложь;
			ФизЛицо=Справочники.ФизическиеЛица.ПустаяСсылка();
			ОтборФизЛиц.Вставить("ФИО",ВРЕГ(Стр.ФИО));
			НайденныеСтроки=ВыборкаФизЛиц.НайтиСтроки(ОтборФизЛиц);
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если ФОРМАТ(НайденнаяСтрока.ДатаРождения,"ДЛФ=Д")=Стр.ДатаРождения ТОгда
					Нашли=Истина;
					ФизЛицо=НайденнаяСтрока.Ссылка;
					Прервать;
				КонецЕсли;			
			КонецЦикла;	
			
			Если Не Нашли ТОгда
				Сообщить("Не найден сотрудник "+ВРЕГ(Стр.ФИО)+" с датой рождения "+ФОРМАТ(Стр.ДатаРождения,"ДЛФ=Д"));  
				Продолжить;
			КонецЕсли;

			НоваяСтрока=Заявка.РаботникиОрганизации.Добавить();
			НоваяСтрока.ФизЛицо=ФизЛицо;	
			НоваяСтрока.НомерЛицевогоСчета=Стр.Картсчет;
			НоваяСтрока.Банк=Банк;
			НоваяСтрока.ДоговорБанка=Договор;
			
			СрезФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ВыбДата, Новый Структура("ФизЛицо", Физлицо));
			Если СрезФИО.Количество() > 0 Тогда
				НоваяСтрока.ЭмбоссированныйТекст1 = СрезФИО[0].Имя;
				   НоваяСтрока.ЭмбоссированныйТекст2 = СрезФИО[0].Фамилия;
			КонецЕсли;
			
		КонецЦикла;
		
		Заявка.Записать();
		Сообщить("Карт счета успешно загружены");
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
	
КонецПроцедуры
